clear
clc

% Данные по условию
v = 2;
k = 1;
Ik0 = 16;
E = 10;

% Расчёты
k15 = 15-k;
Ik = Ik0*k15*10^(-3);
i = [50 100 150 200]*k15*10^(-6);
i0 = i(v+1)-3*i(v)/4;
Id = 3*i0;
Rk = E/(2*Ik);
Rb = E/Id;

% Вывод
fprintf('\t\tДано\n');
fprintf('k = %d\n',k);
for j = 1:4
    fprintf('Ток базы %d\n',j);
    fprintf('iб%1d = %3d*(15-%02d) = %4d мкА\n',j,50*j,k,50*j*k15); 
end
fprintf('\tИз графика\n');
fprintf('Напряжение питания\n');
fprintf('E   = %2d В\n',E);
fprintf('Ток коллектора\n');
fprintf('Ik  = %2d*(15-%02d) = %4d мА\n',Ik0,k,Ik0*k15);
fprintf('Ток базы 0\n');
fprintf('iб0 = %4d мкА\n',50*((v+1)*k15-3*v*k15/4));
fprintf('\n');

fprintf('\t\tРешение\n');
fprintf('Из условия выбора тока делителя равного 3-5 тока базы выберем 3:\n');
fprintf('Id  = 3*iб0 = %4d мкА\n',3*50*((v+1)*k15-3*v*k15/4));
fprintf('Расчитаем сопротивление коллектора\n');
fprintf('Rk  = E/(2*Ik) = %10.6f  Ом\n',Rk);
fprintf('Расчитаем сопротивление базы\n');
fprintf('Rb  = E/Id = %10.6f кОм\n',Rb*10^(-3));
fprintf('Для уменьшения частоты искажений разделительные конденсаторы\n');
fprintf('следует выбирать большой ёмкости (от тысяч мкФ до сотен мФ)\n');
fprintf('Cp1 = %3d мФ\n',33);
fprintf('Cp2 = %3d мФ\n',33);
fprintf('Рабочее напряжение конденсаторов 25 В, что в %.1f раза больше E',25/E);